Revit 2027 API
ParameterTypeId.GridCenterSegmentPattern Property
 "Center Segment Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridCenterSegmentPattern { get; }
Public Shared ReadOnly Property GridCenterSegmentPattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridCenterSegmentPattern {
	ForgeTypeId^ get ();
}
static member GridCenterSegmentPattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace